Repository: DragonZX/ddt4all
Catalog: locale/*/LC_MESSAGES/ddt4all.po
Languages: ru

source: Goto data
ru: Перейти к данным

source: Remove
ru: Удалить

source: Add to screen
ru: Добавить на экран

source: Request name;Bytes;Manual
ru: Имя запроса;Байт;Вручную

source: Add
ru: Добавить

source: Send request bytes (HEX)
ru: Отправит байты запроса (HEX)

source: Receive bytes (HEX)
ru: Получить байты (HEX)

source: Data length
ru: Длина данных

source: No SDS
ru: Нет SDS

source: Plant
ru: Завод

source: After Sale
ru: После Продажи

source: Engineering
ru: Инженерия

source: Supplier
ru: Поставщик

source: Reload requests
ru: Перезагрузить запросы

source: Add request
ru: Добавить запрос

source: Send bytes
ru: Отправить байты

source: Receive bytes
ru: Получить байты

source: Number of bits
ru: Количество бит

source: Signed
ru: Подписано

source: Add item
ru: Добавить пункт

source: Del item
ru: Удалить пункт

source: New item
ru: Новый пункт

source: Value;Text
ru: Значение;Текст

source: Number of bytes
ru: Количество байт

source: Unit
ru: Узел

source: Number of bit
ru: Количество бит

source: Format
ru: Формат

source: Value = (AX+B) / C
ru: Значение = (AX+B) / C

source: New
ru: Новый

source: Duplicate selected
ru: Дублировать выбранное

source: Remove selected
ru: Удалить выбранное

source: Reload
ru: Перезагрузить

source: Validate changes
ru: Проверить изменения

source: Description
ru: Описание

source: Data type
ru: Тип данных

source: Numeric
ru: Числовой

source: Numeric items
ru: Числовые пункты

source: Data is used by request %s
ru: Данные используются запросом %s

source: New data
ru: Новые данные

source: Replace me with request description
ru: Заменить запрошенным описанием

source: Data name;Description
ru: Имя данных;Описание

source: Del
ru: Удалить

source: Refresh
ru: Обновить

source: Move up
ru: Переместить вверх

source: Check
ru: Проверить

source: Request %s not found
ru: Запрос %s не найден

source: <font color=green>Request <font color=blue>'%s'</font> has no missing input values</font>
ru: <font color=green>Запрос <font color=blue>'%s'</font> не имеет пропущенных значений ввода</font>

source: <font color=red>Request <font color=blue>'%s'</font> has missing inputs :</font>
ru: <font color=red>Запрос <font color=blue>'%s'</font> имеет пропущенные значения :</font>

source: Delay;Request
ru: Задержка;Запрос

source: Screen initialization
ru: Инициализация экрана

source: Requests to send before screen drawing
ru: Запросы для отправки перед отрисовкой экрана

source: Button name;Unique name
ru: Имя кнопки;Уникальное имя

source: ECU Function address
ru: Адрес функции ECU

source: ECU Protocol
ru: Протокол ECU

source: Coding
ru: Кодирование

source: Big Endian
ru: Прямой порядок байтов

source: Little Endian
ru: Обратный порядок байтов

source: ECU Auto identification
ru: Автоопределение ECU

source: Diag version;Supplier;Soft;Version
ru: Диаг. версия; Поставщик; ПО; Версия

source: Add new
ru: Добавить новый

source: Delete selected
ru: Удалить выбранное

source: Diag version
ru: Диаг. версия

source: Soft
ru: ПО

source: Version
ru: Версия

source: ECU name
ru: Имя ECU

source: Protocol
ru: Протокол

source: Diag
ru: Диаг

source: Projects
ru: Проекты

source: loaded ECUs in database.
ru: ЭБУ загружено.

source: Refresh rate (ms):
ru: Частота обновления (ms):

source: Can timeout (ms) [0:AUTO] :
ru: Таймаут CAN (мс) [0:АВТО] :

source: Documentation
ru: Документация

source: Screen
ru: Экран

source: CAN Sniffer
ru: Сниффер CAN

source: Requests
ru: Запросы

source: Data
ru: Данные

source: Buttons
ru: Кнопки

source: Ecu parameters
ru: Параметры ЭБУ

source: Screens
ru: Экраны

source: Action
ru: Действия

source: New Category
ru: Новая категория

source: New Screen
ru: Новый экран

source: Rename
ru: Переименовать

source: File
ru: Файл

source: Read DTC
ru: Чтение ошибок DTC

source: Full log
ru: Полный лог

source: Expert mode (enable writing)
ru: Экспертный режим (включает запись)

source: Auto refresh
ru: Авто-обновление

source: Refresh (one shot)
ru: Обновить (один раз)

source: Manual command
ru: Ручной ввод команды

source: Manual request
ru: Ручной запрос

source: Zoom In
ru: Увеличить

source: Zoom Out
ru: Уменьшить

source: UI Edit
ru: Изменить интерфейс

source: Open XML
ru: Открыть XML

source: Identify ECU
ru: Определить ECU

source: Create New ECU
ru: Создать новый ЭБУ

source: Save current ECU
ru: Сохранить ЭБУ

source: Save ECU list
ru: Сохранить список ЭБУ

source: Zip database
ru: Zip Базы Данных

source: Plugins
ru: Плагины

source: Cannot load plugin
ru: Не могу загрузить плагин

source: Save database (keep '.zip' extension)
ru: Сохранить Базу Данных (оставить расширение '.zip')

source: Zipping XML database... (this can take a few minutes
ru: Сжатие XML базы данных... (Это может занять несколько минут)

source: Zip job finished
ru: Сжатие закончено

source: Enter new name
ru: Введите новое название

source: Enter category name
ru: Введите название категории

source: Please select a category before creating new screen
ru: Выберите категорию перед созданием нового экрана

source: Enter screen name
ru: Введите название экрана

source: Scan options
ru: Опции сканирования

source: CANCEL
ru: ОТМЕНА

source: Scanning CAN
ru: Сканирование CAN

source: Scanning KWP
ru: Сканирование KWP

source: EDITION MODE
ru: РЕДАКТОР

source: CONNECTED
ru: ПОДКЛЮЧЕН

source: DISCONNECTED
ru: ОТКЛЮЧЕН

source: Save vehicle (keep '.ecu' extension)
ru: Сохранить список моих ЭБУ (.ecu)

source: Save ECU (keep '.json' extension)
ru: Создание нового ЭБУ (.json)

source: <center>This Software is free, but I need money to buy cables/ECUs and make this application more reliable</center>
ru: <center>Эта программа бесплатна, но мне нужны деньги для покупки тестовых ЭБУ, развития её функциональности и надежности</center>

source: Yes I contribute
ru: Да, я поддержу

source: No, I don't
ru: Нет, не сейчас

source: <center>Thank you for you contribution, if nothing happens, please go to : https://github.com/cedricp/ddt4all</center>
ru: <center>Спасибо за платеж, если не получилось, пожалуйста зайдите на : https://github.com/cedricp/ddt4all</center>

source: ELM port selection
ru: Выберите порт ELM

source: Port speed
ru: Скорость порта

source: Connected mode
ru: Подключиться

source: Edition mode
ru: Редактор

source: ELM benchmark
ru: Проверка ELM

source: WiFi port :
ru: WiFi порт :

source: I'm aware that I can harm my car if badly used
ru: Я понимаю, что могу навредить моему автомобилю

source: Dark style
ru: Тёмная тема

source: You must check the recommendations
ru: Вы должны согласиться с условиями

source: Please select a communication port
ru: Выберите нужный порт

source: Using custom DDT database
ru: Используем альтернативную базу DDT

source: No COM port selected
ru: Не выбран COM порт

source: Initialising ELM with speed %i...
ru: Инициализация ELM на скорости %i...

source: No ELM327 or OBDLINK-SX detected on COM port
ru: ELM327 или OBDLINK-SX не обнаружены на COM порту

source: Error:
ru: Ошибка:

source: ELM not connected or wrong COM port
ru: ELM не подключен или неверный COM порт

source: Connection to ELM was lost
ru: Связь с ELM потеряна

source: TIMEOUT
ru: ТАЙМАУТ

source: Checking port speed:
ru: Проверка скорости порта:

source: Start COM speed :
ru: Скорость COM порта :

source: ELM not responding
ru: ELM не отвечает

source: ERROR - wifi do not support changing baud rate
ru: ОШИБКА - wifi не поддерживает изменение скорости порта

source: Changing baud rate to:
ru: Изменение скорости порта на:

source: ERROR - command not supported
ru: ОШИБКА - команда не поддерживается

source: ERROR - rate not supported. Let's go back.
ru: ОШИБКА - заданная скорость не поддерживается. Возвращаем прежнюю скорость.

source: ERROR - something went wrong. Let's get back.
ru: ОШИБКА - что-то пошло не так. Возвращаем прежнюю скорость.

source: Trying to open port
ru: Пытаемся открыть порт

source: No ELM interface on port
ru: ELM не обнаружен

source: FAIL
ru: ОШИБКА

source: Incompatible adapter on ARM core
ru: Несовместимый адаптер на ARM ядре

source: Result:
ru: Результат:

source: succeeded from
ru: успешных из

source: ELM Max version:
ru: Максимальная версия ELM:

source: Adding source file %s
ru: Добавление файла источник %s

source: Adding plugin file %s
ru: Добавление файла плагина %s

source: To be able to edit your screen, first export it in JSON format
ru: Для редактирования экрана сначала сохраните его в JSON

source: Enter label name
ru: Введите имя надписи

source: Add button
ru: Добавить кнопку

source: Add label
ru: Добавить надпись

source: Rename label
ru: Переименовать надпись

source: Change color
ru: Изменить цвет

source: Remove element
ru: Удалить надпись

source: Diagnostic session
ru: Диагностическая сессия

source: Input
ru: Поле ввода

source: Output
ru: Поле вывода

source: XML file not found :
ru: XML файл не найден :

source: Invalid DDT file
ru: Неверный DDT файл

source: Connection to ELM lost, trying to reconnect...
ru: Соединение с ELM потеряно, восстанавливаем связь...

source: Cannot reconnect...
ru: Невозможно переподключиться...

source: Switching to session mode
ru: Переключение в режим

source: Sending ELM request :
ru: Отправляем ELM запрос :

source: Blocked ELM request :
ru: Блокированный ELM запрос :

source: Sending ELM request:
ru: Отправляем ELM запрос :

source: Sending simulated ELM request :
ru: Отправляем симуляционный ELM запрос :

source: Bad ELM response :
ru: Неверный ответ ELM :

source: ELM response :
ru: Ответ ELM :

source: Button request not found :
ru: Нет параметров для кнопки :

source: Sending request :
ru: Отправка запроса :

source: Request aborted (look at red parameters entries):
ru: Запрос прерван (проверьте красные записи):

source: Invalid
ru: Не считано

source: ECU uses SDS
ru: ECU использует SDS

source: Cannot call request
ru: Не могу сформировать запрос

source: Clearing DTC information
ru: Сброс ошибок DTC

source: No ClearDTC request for that ECU, will send default 14FF00
ru: У ЭБУ нет запроса ClearDTC, буду посылать стандартный 14FF00

source: <center>You are about to clear diagnostic troubles codes</center>
ru: <center>Ошибки DTC сейчас будут стерты</center>

source: <center>Ae you sure this is what you want.</center>
ru: <center>Вы уверены?</center>

source: Invalid response for ReadDTC command
ru: Неверный отклик на команду чтения ошибок

source: Read DTC returned an error
ru: Чтение DTC вернуло ошибку

source: No DTC
ru: Нет ошибок DTC

source: Clear ALL DTC
ru: Сбросить ВСЕ ошибки

source: ECU trouble codes
ru: Считанные ошибки

source: Parsing screen
ru: Расшифровка

source: Values
ru: Значение

source: Waiting...
ru: Ожидание...

source: Frame hex error :
ru: Ошибка фрейма hex :

source: AB90 AIRBAG Reset
ru: AB90 AIRBAG Сброс

source: Airbag Tools
ru: Инструменты Подушки Безопасности

source: Check ACU Virgin
ru: Проверка чистоты ACU

source: Waiting
ru: Ожидание

source: Virginize ACU
ru: Очистка ACU

source: Cannot connect to ECU
ru: Невозможно подключиться к ECU

source: <font color='orange'>UNEXPECTED RESPONSE</font>
ru: <font color='orange'>НЕОЖИДАННЫЙ ЗАПРОС</font>

source: <font color='red'>CRASH DETECTED</font>
ru: <font color='red'>ОБНАРУЖЕНА АВАРИЯ</font>

source: <font color='green'>NO CRASH DETECTED</font>
ru: <font color='green'>АВАРИЯ НЕ ОБНАРУЖЕНА</font>

source: <font color='green'>CLEAR EXECUTED</font>
ru: <font color='green'>ОЧИСТИТЬ ВЫПОЛНЕННОЕ</font>

source: <font color='red'>CLEAR FAILED</font>
ru: <font color='red'>ОЧИСТИТЬ НЕУДАЧНОЕ</font>

source: Keys
ru: Ключи

source: ENTER AFTER SALE MODE
ru: ВОЙТИ В ПОСТПРОДАЖНЫЙ РЕЖИМ

source: <font color='red'>MEGANE II CARD PROGRAMMING<br>EXPERIMENTAL : NOT TESTED YET</font>
ru: <font color='red'>MEGANE II ПРОГРАММИРОВАНИЕ КАРТЫ<br>ЭКСПЕРИМЕНТАЛЬНО : НЕ ТЕСТИРОВАЛОСЬ</font>

source: LEARN
ru: ОБУЧЕНИЕ

source: VALIDATE
ru: ПРОВЕРИТЬ

source: Algo 2
ru: Алгоритм 2

source: <font color='red'>PIN CODE NOT RECOGNIZED</font>
ru: <font color='red'>PIN КОД НЕ РАСПОЗНАН</font>

source: EPS Tools
ru: Инструменты EPS

source: Virginize EPS
ru: Очистка EPS

source: VIN - READ
ru: VIN - ЧТЕНИЕ

source: VIN - WRITE
ru: VIN - ЗАПИСЬ

source: Write VIN
ru: Запись VIN

source: <font color='red'>VIN - INVALID</font>
ru: <font color='red'>VIN - НЕВЕРЕН</font>

source: <font color='res'>VIN - BAD LENGTH</font>
ru: <font color='res'>VIN - НЕВЕРНАЯ ДЛИНА</font>

source: <font color='orange'>VIN WRITE FAILED</font>
ru: <font color='orange'>VIN ЗАМИСЬ НЕ УДАЛАСЬ</font>

source: <font color='green'>VIN WRITE OK</font>
ru: <font color='green'>VIN ЗАПИСАН</font>

source: <font color='green'>EPS virgin</font>
ru: <font color='green'>EPS чистый</font>

source: <font color='red'>EPS coded</font>
ru: <font color='red'>EPS кодированный</font>

source: Clio IV EPS Reset
ru: Clio IV EPS Сброс

source: Check EPS Virgin
ru: Проверить чистоту EPS

source: <font color='green'>EPS not operational</font>
ru: <font color='green'>EPS недоступен для операций</font>

source: <font color='red'>UNEXPECTED RESPONSE</font>
ru: <font color='red'>НЕОЖИДАННЫЙ ОТВЕТ</font>

source: Laguna II UCH Reset
ru: Laguna II UCH Сброс

source: Check UCH Virgin
ru: Проверить чистоту UCH

source: Virginize UCH
ru: Очистка UCH

source: <font color='green'>UCH virgin</font>
ru: <font color='green'>UCH очищен</font>

source: <font color='red'>UCH coded</font>
ru: <font color='red'>UCH кодирован</font>

source: Laguna III UCH Reset
ru: Laguna III UCH Сброс

source: Megane/Scenic II UCH Reset
ru: Megane/Scenic II UCH Сброс

source: Megane3 AIRBAG Reset
ru: Megane3 AIRBAG Сброс

source: ZOE/FLENCE/Megane III/Scenic III EPS Reset
ru: ZOE/FLENCE/Megane III/Scenic III EPS Сброс

source: Megane/Scenic III UCH Reset
ru: Megane/Scenic III UCH Сброс

source: MEGANE III UCH VIRGINIZER<br><font color='red'>THIS PLUGIN WILL ERASE YOUR UCH<br>GO AWAY IF YOU HAVE NO IDEA OF WHAT IT MEANS</font>
ru: MEGANE III ОЧИСТКА UCH<br><font color='red'>ЭТОТ ПЛАГИН СБРОСИТ ВАШ UCH<br>УХОДИТЕ, ЕСЛИ НЕ ПОНИМАЕТЕ ЧТО ЭТО ОЗНАЧАЕТ</font>

source: RSAT4 AIRBAG Reset
ru: RSAT4 AIRBAG Сброс

source: CRC calculator
ru: CRC калькулятор

source: CRC CALCULATOR
ru: CRC КАЛЬКУЛЯТОР
